app/controllers/actividades_controller.rb

  def index
    @actividades = Actividade.all
---
SELECT "ACTIVIDADES".* FROM "ACTIVIDADES"