app/controllers/clientes_controller.rb

INSERT INTO "CLIENTES" ("NOMBRE", "APELLIDO_PATERNO", "APELLIDO_MATERNO", "RUT", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7)
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

UPDATE "CLIENTES" SET "APELLIDO_MATERNO" = :a1, "UPDATED_AT" = :a2 WHERE "CLIENTES"."ID" = :a3  [["apellido_materno", "savedra"], ["updated_at", "2019-10-14 20:29:51.077599"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @cliente.update(cliente_params)

DELETE FROM "CLIENTES" WHERE "CLIENTES"."ID" = :a1  [["id", 1]]
---
  def destroy
    @cliente.destroy

SELECT "CLIENTES".* FROM "CLIENTES" WHERE "CLIENTES"."ID" = :a1 AND ROWNUM <= :a2   [["id", 1], ["LIMIT", 1]]
---
    def set_cliente
      @cliente = Cliente.find(params[:id])