app/controllers/profesionales_controller.rb

  def index
    @profesionales = Profesionale.all
---
SELECT "PROFESIONALES".* FROM "PROFESIONALES"